---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Infrastructure.Alignment
source: html/b9027fe7-f494-2a41-4a5d-90348d81bd62.htm
---
# Alignment Members

Returns an Alignment object given a Revit alignment element.